app/controllers/artworks_controller.rb

  def create
    @artwork = Artwork.new(artwork_params)

    respond_to do |format|
      if @artwork.save
---
INSERT INTO "artworks" ("duration", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["duration", 10], ["created_at", "2024-02-20 14:03:14.355708"], ["updated_at", "2024-02-20 14:03:14.355708"]]

    def set_artwork
      @artwork = Artwork.find(params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]