app/controllers/spotify_canvas_controller.rb

  def set_user
    @user = SpotifyUser.first
---
SELECT "spotify_users".* FROM "spotify_users" ORDER BY "spotify_users"."id" ASC LIMIT ?  [["LIMIT", 1]]