app/controllers/spotify_controller.rb

INSERT INTO "spotify_users" ("auth_data", "mail", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["auth_data", "<1117 bytes of binary data>"], ["mail", "saschaheld@me.com"], ["created_at", "2024-02-18 15:37:17.589726"], ["updated_at", "2024-02-18 15:37:17.589726"]]
---
  def authenticate
    spotify_user = RSpotify::User.new(request.env['omniauth.auth'])
    spotify_user_hash = spotify_user.to_hash

    pp player = spotify_user.player

    SpotifyUser.new(
      mail: spotify_user.email,
      auth_data: spotify_user_hash
    ).save