app/controllers/spotify_canvas_controller.rb

SELECT "spotify_users".* FROM "spotify_users" ORDER BY "spotify_users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def set_user
    @user = SpotifyUser.first
    handle_no_user if @user.blank?